package com.rabigol.wowmoney;

/**
 * Created by Artur.Ziaev on 02.11.2016.
 */

public class ToDo {
    // + показать все операции в мейнактивити (генерация, потом отображение)
    // + ID всех операций
    // + добавление операций
    // + обновление листа после добавления
    // + изменение операции
    // + удаление операций
    //TODO: Краш при создании новой записи при нажатии FAB (не знаю куда воткнуть notifyDataChanged)
    // + выбор категорий из списка
    // + выбор счетов из списка
    // + выбор валют из списка
    // + Logout in menu
    // + Разлогиниться при onDestroy >> onStop
    // + Знак операции в зависимости от типа операции
    // + Заебенить баланс картинку (header view)
    //TODO: from > to
    //TODO: Зависимость типа категории от операции
    //TODO: вывод баланса
    //TODO: Добавить значок прилложения
    //TODO: Разобраться с датами
	//TODO: Инструмент ввода и изменения даты
    //TODO: Сортировка по дате, сумме
    //TODO: RESTApi??
    //TODO: авторизация, регистрация, восстановление
    //TODO: листать viewPager обучение
    //TODO: Полупрозрачный экшнбар с градиентом

    //next release
    //TODO: Snackbar "отмена операции" при удалении
    //TODO: Настройки валют
    //TODO: Настройки категорий
    //TODO: Настройки баланса
    //TODO: Создание счетов
}


