package com.rabigol.wowmoney;

/**
 * Created by Artur.Ziaev on 02.11.2016.
 */

public class ToDo {
    // + показать все операции в мейнактивити (генерация, потом отображение)
    // + ID всех операций
    // + добавление операций
    // + обновление листа после добавления
    // + изменение операции
    // + удаление операций
    //TODO: Краш при создании новой записи при нажатии FAB (не знаю куда воткнуть notifyDataChanged)
    // + выбор категорий из списка
    // + выбор счетов из списка
    // + выбор валют из списка
    //TODO: Знак операции в зависимости от типа операции
    //TODO: Зависимость типа категории от операции
    //TODO: заебенить баланс картинку
    //TODO: Разобраться с датами
    //TODO: Сортировка по дате, сумме
    //TODO: вывод баланса
    //TODO: RESTApi??
    //TODO: авторизация, регистрация, восстановление

    //TODO: ASK: как генерить айди операций правильно?
    //TODO: листать viewPager обучение
    //TODO: Полупрозрачный экшнбар с градиентом

    //next release
    //TODO: Snackbar "отмена операции" при удалении
    //TODO: Настройки валют
    //TODO: Настройки категорий
    //TODO: Настройки баланса
    //TODO: Создание счетов
}


